; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Simon Lбszlу <slaszlo1@freemail.hu>
; 
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Mйgsem"
MAIN_DEST_DIR_LABEL = "&Cйlkцnyvtбr:"
MAIN_FILE_LABEL = "&Archнv/Telepнtх a kicsomagolбshoz:"
MENU_FILE_LABEL = "&Fбjl"
MENU_FILE_QUIT_LABEL = "&Kilйpйs"
MENU_EDIT_LABEL = "&Szerkesztйs"
MENU_EDIT_PREFS_LABEL = "&Beбllнtбsok"
MENU_HELP_LABEL = "&Sъgу"
MENU_HELP_WEB_LABEL = "%s &Web oldal"
PREFS_TITLE_LABEL = "Beбllнtбsok"
PREFS_UNIEXTRACT_OPTS_LABEL = "Universal Extractor Beбllнtбsok"
PREFS_HISTORY_LABEL = "Keep track of archive &history"
PREFS_FORMAT_OPTS_LABEL = "Format-Specific Options"
PREFS_LANG_LABEL = "&Nyelv"
PREFS_DEBUG_LABEL = "&Hibafбjl kцnyvtбr:"
PREFS_WARN_EXECUTE_LABEL = "Figyelmeztetйs a fбjlok kicsomagolбsa elхtt"
PREFS_REMOVE_DUPE_LABEL = "&Duplikбlt fбjlok eltбvolнtбsa"
PREFS_REMOVE_TEMP_LABEL = "Ideiglenes fбjlok el&tбvolнtбsa"
PREFS_APPEND_EXT_LABEL = "&Append missing file extensions"
METHOD_ADMIN_RADIO = "%s Adminisztratнv telepнtх"
METHOD_EXTRACTION_RADIO = "%s kicsomagolбs"
METHOD_HEADER = "%s Kicsomagolбs"
METHOD_MSI_NOTE_LABEL = "Megjegyzйs:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml szьksйges a"
METHOD_MSI_URL_LABEL = "MSXML 4.0 Parser"
METHOD_RADIO_LABEL = "Kicsomagolбsi eljбrбs"
METHOD_SWITCH_RADIO = "%s kapcsolу"
METHOD_NOTIS_RADIO = "Nem egy InstallShield telepнtх"
METHOD_TEXT_LABEL = "%s tбmogatottak a kцvetkezх eljбrбsok a %s csomaghoz.  Sajnos, ez az eljбrбs nem 100%-os biztonsбggal tбmogatott.  Amennyiben az alapйrtelmezett eljбrбs nem mыkцdne, kйrem tйrjen vissza %s йs vбlasszon egy mбsik eljбrбst."
METHOD_UNPACKER_RADIO = "%s Kicsomagolу"

; GUI control functions
DOES_NOT_EXIST = "nem lйtezik.%n"
EXTRACT_TO = "Kicsomagolбs ide"
INVALID_DIR_SELECTED =  "%s nem йrvйnyes kцnyvtбr."
INVALID_FILE_SELECTED = "%sKйrem vбlasszon egy йrvйnyes fбjlt."
OPEN_FILE = "Fбjl megnyitбsa"
SELECT_FILE = "Fбjl kivбlasztбsa"
WRITE_TO = "Нrбs ide"

; Common terms
TERM_ARCHIVE = "archнv"
TERM_COMPRESSED = "tцmцrнtett fбjl"
TERM_DISK = "lemez"
TERM_EBOOK = "ebook"
TERM_ECARD = "ecard"
TERM_ENCODED = "kуdolt fбjl"
TERM_EXECUTABLE = "futatthatу"
TERM_FAILED = "sikertelen"
TERM_HELP = "Sъgу"
TERM_HOTFIX = "javнtбs"
TERM_IMAGE = "kйp"
TERM_INSTALLER = "telepнtх"
TERM_PACKAGE = "csomag"
TERM_PATCH = "javнtбs"
TERM_SFX = "Цnkicsomagolу"
TERM_STAGE = "Szint"
TERM_SUCCEEDED = "sikerьlt"
TERM_TESTING = "Vizsgбlat"
TERM_UNKNOWN = "ismeretlen"
TERM_UNPACKED = "kicsomagolt"
TERM_UPDATER = "updater"

; Status messages
SCANNING_FILE = "Scanning file to determine filetype."
SCANNING_EXE = "Scanning file with %s scan."
EXTRACTING = "Fбjlok kicsomagolбsa innen:"
INIT_WAIT = "Vбrakozбs a telepнtх inicializбlбsбhoz.%nKйrem vбrjon."

; Custom prompts
CONVERT_CDROM = "A %s CD-ROM kйpfбjl nem futatthatу kцzvetlenьl.  Ezйrt ez a kйpfбjl most konvertбlva lesz egy ISO CD-ROM kйpfбjlba, amelyik mбr futatthatу lesz.%n%nSzeretnй folytatni?%nMegjegyzйs: Ez a folyamat nйhбny percet vesz igйnybe."
CONVERT_CDROM_STAGE1_FAILED = "Hiba:  A CD-ROM kйpfбjl nem konvertбlhatу.%nAmennyiben ez egy BIN/CUE kйpfбjl, kйrem ellenхrizze, hogy a CUE fбjl helyes formбtumba van-e?."
CONVERT_CDROM_STAGE2_FAILED = "Hiba:  An ISO image was created from the %s image, but it could not be converted.%nSzeretnй megtartani az ISO fбjl egy kйsхbbi analнzis szбmбra?"
CONVERT_BIN_MISSING = "Hiba: Nem talбlhatу:%n%s\%s.bin%n%nA %s.bin йs a %s.cue is szьksйges."
INIT_COMPLETE = "Az Inicializбlбs befejezett.  Kйrem lйpjen ki a telepнtхbхl, azutбn klikkeljen az OK-ra a folytatбshoz."
WISE_MSI_PROMPT = "Megjegyzйs:  Ezen eljбrбs csak speciбlis Wise for Windows Installer csomagokkal dolgozik.%nAmennyiben a Wise Installation Wizard elindul йs bevitelre vбr, ez a fбjl nem%ntбmogatott.  Kйrem lйpjen ki a telepнtхbхl, йs %s szakнtsa meg a kicsomagolбst.%n%nFolytatni szeretnй?"
UNPACK_PROMPT = "Ez a fбjl %s tцmцrнtйssel csomagolt, de nem lehet kicsomagolni.%nEz azйrt lehet, mert a fбjltнpus nem tбmogatott, vagy mert%n"egyszerыen nem tartalmaz fбjlokat a kicsomagolбshoz.%n%nSzeretnй ezt a fбjlt kicsomagolni helyette?%n%nMegjegyzйs: A kicsomagolt fбjl neve:%n%s\%s_unpacked.%s lesz"
UNPACK_FAILED = "Hiba: %s%nnem kicsomagolhatу."
WARN_EXECUTE = "Warning:  In order to extract files of this type, the file must be directly executed.%nIf you continue, the following command will be run:%n%n%s%n%nIf you believe this file may possibly be malicious, it is recommended that you do not continue.%nDo you want to continue with extraction?"

; Help text
HELP_SUMMARY = "Kicsomagolt fбjlok valamilyen archнv tнpusbуl vagy telepнtх csomagbуl."
HELP_SYNTAX = "%nHasznбlat:  %s [/help] [fбjlnйv [cйl]]"
HELP_ARGUMENTS = "%n%nTбmogatott argumentumok:"
HELP_HELP = "%n     /sъgу%t%tEzen Sъgу informбciу kijelzйse"
HELP_FILENAME = "%n     fбjlnйv%tFбjl neve a kicsomagolбshoz"
HELP_DESTINATION = "%n     cйl%tA kicsomagolandу fбjlok kцnyvtбra"
HELP_SUB = "%n%nPassing /sub instead of a destination directory name instructs%n%s to extract to subdirectory named after the archive."
HELP_EXAMPLE1 = "%n%nPйldбъl:"
HELP_EXAMPLE2 = "%n     %s c:\1\example.zip c:\test"
HELP_NOARGS = "%n%nA Futtatбs %s argumentumok nйlkьl a felhasznбlуnak jelezni fogja a fбjlnevet йs a cйlkцnyvtбrat."

; Error messages
CANNOT_LOG = "%s a kicsomagolбs nem naplуzott."
CANNOT_DEBUG = "The debug file output directory, "%s", is not writable.%nYour temp directory will be used instead."
CANNOT_EXTRACT = "%s nem kicsomagolhatу.%nFбjltнpus visszatйrt: %s%n%nKlikkeljen az OK gombra amennyiben szeretnй analizбlni a fбjlt, vagy Klikkeljen a Mйgsem gombra kilйpйshez."
UNKNOWN_EXT = "%s%n egy ismeretlen kiterjesztйs йs nem kicsomagolhatу."
INVALID_DIR = "%s%nnem lйtrehozhatу.  Kйrem vбlasszon egy йrvйnyes rendeltetйsi helyet."
EXTRACT_FAILED = "%s nem kicsomagolhatу.%nEz %s ъgy lбtszik, hogy tбmogatott, de a kicsomagolбs sikertelen.%nKйrem nйzze meg a log fбjlt, %s, tцbb informбciуйrt.%n%nKlikkeljen az OK gombra a log fбjl megtekintйsйhez, vagy a Mйgsem gombra kilйpйshez."

[Installer]
; Components page
COMP_DOCS = "Dokumentбciу йs licensz informбciу"
COMP_LANG = "Nyelvi fбjlok a nemzetkцzi tбmogatбsйrt"
COMP_ACE = "Support for ACE files"
COMP_KGB = "Support for KGB files"
COMP_PEA = "Support for Pea files"
COMP_SIT = "Support for StuffIt files"

; Preferences page
PREFS_CAPTION = "Program opciуk beбllнtбsa"
PREFS_DESCRIPTION = "Melyik Universal Extractor opciуt szeretnй beбllнtani?"
PREFS_LABEL1 = "Beбllнthatja a kцvetkezх opciуkat az Universal Extractor alapйrtelmezett beбllнtбsaira."
PREFS_LABEL2 = "Ezt az opciуt meg tudja vбltoztatni telepнtйs utбn is az UniExtract.ini mуdosнtбsбval."
LANGUAGE_LABEL = "Alapйrtelmezett Nyelv"
DEBUG_LABEL = "Hibafбjl hely"
APPEND_EXT_LABEL = "&Append missing file extensions"
HISTORY_LABEL = "&Az Archнv elхzmйnyek karbantartбsa"
REMOVE_DUPE_LABEL = "A &dupla fбjlok eltбvolнtбsa"
REMOVE_TEMP_LABEL = "Az ideiglenes fбjlok el&tбvolнtбsa"
WARN_EXECUTE_LABEL = "Figyelmeztetйs a fбjlok kicsomagolбsa elхtt"

; Tasks page
ASSOCIATE = "Az &Explorer kцrnyezeti menь integrбlбsбnak engedйlyezйse"
ASSOCIATE_FILES = "UniExtract &Fбjlok hozzбadбsa... a kцrnyezeti menьhцz"
ASSOCIATE_HERE = "UniExtract &Here hozzбadбsa a kцrnyezeti menьhцz"
ASSOCIATE_SUBDIR = "UniExtract hozzбadбsa az &alkцnyvtбrhoz a kцrnyezeti menьbe"
ASSOCIATE_FORCE = "Kйnyszerнtх &tбrsнtбs az цsszes tбmogatott archнv formбtummal"
MODIFY_PATH = "Az Universal Extractor hozzбadбsa a rendszer &elйrйsi ъthoz"
DESKTOP_ICON = "&Asztal ikon kйszнtйse"
QUICK_LAUNCH_ICON = "&Gyorsindнtу ikon kйszнtйse"
SENDTO_ICON = "Create a Send&To icon"

; Context Menu integration
EXTRACT_FILES = "UniExtract &Fбjlok..."
EXTRACT_HERE = "UniExtract &Here"
EXTRACT_SUB = "UniExtract &Alkцnyvtбrhoz"
